Extensions/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Хозрасчетный</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <chartOfAccounts>Checked</chartOfAccounts>
    <correspondence>Checked</correspondence>
  </extension>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
  </dimensions>
  <resources>
    <name>СуммаВР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
  </resources>
  <resources>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
    <balance>true</balance>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
  </resources>
  <resources>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
      <balance>Checked</balance>
    </extension>
  </resources>
  <attributes>
    <name>Содержание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:AccountingRegister>

Extensions/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КурсыВалют</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources>
    <name>Кратность</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Extensions/src/AccountingRegisters/Хозрасчетный/RecordSetModule.bsl
&После("ПередЗаписью")
Процедура РасшAzRy_ПередЗаписью(Отказ, РежимЗаписи)
	
	Документ = ЭтотОбъект.Отбор.Регистратор.Значение;	
	ВалютаUSD = Справочники.Валюты.НайтиПоКоду("840");
	Если ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ЗакрытиеМесяца") 
		Или (ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументСсылка.ОперацияБух") И НачалоДня(ЭтотОбъект.Отбор.Регистратор.Значение.Дата) = НачалоДня(КонецМесяца(ЭтотОбъект.Отбор.Регистратор.Значение.Дата))) Тогда
		ВалютаРасчетовКурсКратность = ЗапросСреднийКурсЗаМесяц(ЭтотОбъект.Отбор.Регистратор.Значение.Дата, ВалютаUSD);
	Иначе 
		ВалютаРасчетовКурсКратность = РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Документ.Дата, Новый Структура("Валюта", ВалютаUSD));	
	КонецЕсли;
	
	НаборЗаписей = РегистрыБухгалтерии.AzRyХозрасчетныйUSD.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Регистратор.Установить(Документ.Ссылка);
	
	Для каждого ТекЗапись Из ЭтотОбъект Цикл
			
		Движение = НаборЗаписей.Добавить(); 	
		ЗаполнитьЗначенияСвойств(Движение, ТекЗапись);
		
		Движение.Сумма = УправлениеНебольшойФирмойСервер.ПересчитатьИзВалютыВВалюту(ТекЗапись.Сумма, 1, ВалютаРасчетовКурсКратность.Курс, 1, ВалютаРасчетовКурсКратность.Кратность);
		
		Для каждого ТекСубконто Из ТекЗапись.СубконтоДт Цикл
			Движение.СубконтоДт.Вставить(ТекСубконто.Ключ, ТекСубконто.Значение);
		КонецЦикла;
		
		Для каждого ТекСубконто Из ТекЗапись.СубконтоКт Цикл
			Движение.СубконтоКт.Вставить(ТекСубконто.Ключ, ТекСубконто.Значение);
		КонецЦикла;
			
	КонецЦикла; 
	
	Если НаборЗаписей.Количество() > 0 Тогда
		НаборЗаписей.Записать();	
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросСреднийКурсЗаМесяц(Период, Валюта) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СРЕДНЕЕ(КурсыВалют.Курс) КАК Курс,
		|	СРЕДНЕЕ(КурсыВалют.Кратность) КАК Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют КАК КурсыВалют
		|ГДЕ
		|	КурсыВалют.Период МЕЖДУ &Период1 И &Период2
		|	И КурсыВалют.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Период1", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("Период2", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Ответ = Новый Структура("Курс, Кратность", РезультатЗапроса[0].Курс, РезультатЗапроса[0].Кратность);
	
	Возврат Ответ;
	
КонецФункции
